In [ ]:
import pandas as pd
data={'Tid':[1,2,3,4,5,6,7,8,9,10],
      'Refund': ['Yes','No','No','Yes','No','No','Yes','No','No','No'],
      'Marital Status' : ['Single','Married','Single','Married','Divorced','Married','Divorced','Single','Married', 'Single'],
      'Taxable Income' : [125000, 100000, 70000,120000,95000,60000,220000, 85000,75000,90000],
      'Cheat':['No','No','No','No','Yes','No','No','Yes','No','Yes']}

d=pd.DataFrame(data)
print(d)

   Tid Refund Marital Status  Taxable Income Cheat
0    1    Yes         Single          125000    No
1    2     No        Married          100000    No
2    3     No         Single           70000    No
3    4    Yes        Married          120000    No
4    5     No       Divorced           95000   Yes
5    6     No        Married           60000    No
6    7    Yes       Divorced          220000    No
7    8     No         Single           85000   Yes
8    9     No        Married           75000    No
9   10     No         Single           90000   Yes

In [ ]:
print(d.iloc[[0,4,7,8]])

   Tid Refund Marital Status  Taxable Income Cheat
0    1    Yes         Single          125000    No
4    5     No       Divorced           95000   Yes
7    8     No         Single           85000   Yes
8    9     No        Married           75000    No

In [ ]:
print(d.iloc[3:8])

   sepal_length  sepal_width  petal_width species
3           4.6          3.1          0.2  setosa
4           5.0          3.6          0.2  setosa
5           5.4          3.9          0.4  setosa
6           4.6          3.4          0.3  setosa
7           5.0          3.4          0.2  setosa

In [ ]:
print(d.iloc[4:9,2:5])

   petal_width species
4          0.2  setosa
5          0.4  setosa
6          0.3  setosa
7          0.2  setosa
8          0.2  setosa

In [ ]:
print(d.iloc[0:10,1:4])

  Refund Marital Status  Taxable Income
0    Yes         Single          125000
1     No        Married          100000
2     No         Single           70000
3    Yes        Married          120000
4     No       Divorced           95000
5     No        Married           60000
6    Yes       Divorced          220000
7     No         Single           85000
8     No        Married           75000
9     No         Single           90000

In [ ]:
df_csv=pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv')
print(df_csv.head())

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [ ]:
d=df_csv.drop(index=3)
d=df_csv.drop(columns=df_csv.columns[2])
print(d)

     sepal_length  sepal_width  petal_width    species
0             5.1          3.5          0.2     setosa
1             4.9          3.0          0.2     setosa
2             4.7          3.2          0.2     setosa
3             4.6          3.1          0.2     setosa
4             5.0          3.6          0.2     setosa
..            ...          ...          ...        ...
145           6.7          3.0          2.3  virginica
146           6.3          2.5          1.9  virginica
147           6.5          3.0          2.0  virginica
148           6.2          3.4          2.3  virginica
149           5.9          3.0          1.8  virginica

[150 rows x 4 columns]

In [9]:
import pandas as pd
data={'Employee_ID':[101,102,103,104,105],
      'Name':['Alice', 'Bob', 'Charlie', 'Diana','Edward'],
      'Department':['HR','IT','IT','Marketing','Sales'],
      'Age':[29,34,41,28,38],
      'Salary':[50000,70000,65000,55000,60000],
      'Years':[4,8,10,3,12],
      'Joining Date':['2020-03-15','2017-07-19','2013-06-01','2021-02-10','2010-11-25'],
      'Gender':['Female','Male','Male','Female','Male'],
      'Bonus':[5000,7000,6000,4500,5000],
      'Rating':[4.5,4.0,3.8,4.7,3.5]
}
d=pd.DataFrame(data)
print(d)

   Employee_ID     Name Department  Age  Salary  Years Joining Date  Gender  \
0          101    Alice         HR   29   50000      4   2020-03-15  Female
1          102      Bob         IT   34   70000      8   2017-07-19    Male
2          103  Charlie         IT   41   65000     10   2013-06-01    Male
3          104    Diana  Marketing   28   55000      3   2021-02-10  Female
4          105   Edward      Sales   38   60000     12   2010-11-25    Male

   Bonus  Rating
0   5000     4.5
1   7000     4.0
2   6000     3.8
3   4500     4.7
4   5000     3.5
Shape:  (5, 10)

In [10]:
print("Shape: ", d.shape)

Shape:  (5, 10)

In [ ]:
print(d.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Employee_ID   5 non-null      int64
 1   Name          5 non-null      object
 2   Department    5 non-null      object
 3   Age           5 non-null      int64
 4   Salary        5 non-null      int64
 5   Years         5 non-null      int64
 6   Joining Date  5 non-null      object
 7   Gender        5 non-null      object
 8   Bonus         5 non-null      int64
 9   Rating        5 non-null      float64
dtypes: float64(1), int64(5), object(4)
memory usage: 532.0+ bytes
None

In [ ]:
print(d.describe())

       Employee_ID        Age       Salary      Years   Bonus    Rating
count     5.000000   5.000000      5.00000   5.000000     5.0  5.000000
mean    103.000000  34.000000  60000.00000   7.400000  5500.0  4.100000
std       1.581139   5.612486   7905.69415   3.847077  1000.0  0.494975
min     101.000000  28.000000  50000.00000   3.000000  4500.0  3.500000
25%     102.000000  29.000000  55000.00000   4.000000  5000.0  3.800000
50%     103.000000  34.000000  60000.00000   8.000000  5000.0  4.000000
75%     104.000000  38.000000  65000.00000  10.000000  6000.0  4.500000
max     105.000000  41.000000  70000.00000  12.000000  7000.0  4.700000

In [ ]:
print(d.iloc[0:5,7:10])

   Gender  Bonus  Rating
0  Female   5000     4.5
1    Male   7000     4.0
2    Male   6000     3.8
3  Female   4500     4.7
4    Male   5000     3.5

In [ ]:
print("Average Salary: ", d["Salary"].mean())

Average Salary:  60000.0

In [ ]:
print("Total bonus: ", d["Bonus"].sum())

Total bonus:  27500

In [ ]:
print("Youngest employee's age: ", d["Age"].min())

Youngest employee's age:  28

In [ ]:
print("Highest performance rating: ", d["Rating"].max())

Highest performance rating:  4.7

In [ ]:
sort=d.sort_values(by="Salary", ascending=False)
print(sort)

   Employee_ID     Name Department  Age  Salary  Years Joining Date  Gender  \
1          102      Bob         IT   34   70000      8   2017-07-19    Male
2          103  Charlie         IT   41   65000     10   2013-06-01    Male
4          105   Edward      Sales   38   60000     12   2010-11-25    Male
3          104    Diana  Marketing   28   55000      3   2021-02-10  Female
0          101    Alice         HR   29   50000      4   2020-03-15  Female

   Bonus  Rating
1   7000     4.0
2   6000     3.8
4   5000     3.5
3   4500     4.7
0   5000     4.5

In [11]:
d["Performance"]=pd.cut(
    d["Rating"],
    bins=[0,4.0,4.5,5],
    labels=["Average","Good","Excellent"]
)
print(d[["Name", "Performance"]])

      Name Performance
0    Alice        Good
1      Bob     Average
2  Charlie     Average
3    Diana   Excellent
4   Edward     Average

In [ ]:
print(d.isnull().sum())

Employee_ID     0
Name            0
Department      0
Age             0
Salary          0
Years           0
Joining Date    0
Gender          0
Bonus           0
Rating          0
Tax             0
Performance     0
dtype: int64

In [12]:
df=d.rename(columns={'Employee ID':'ID'})
print(df)

   Employee_ID     Name Department  Age  Salary  Years Joining Date  Gender  \
0          101    Alice         HR   29   50000      4   2020-03-15  Female
1          102      Bob         IT   34   70000      8   2017-07-19    Male
2          103  Charlie         IT   41   65000     10   2013-06-01    Male
3          104    Diana  Marketing   28   55000      3   2021-02-10  Female
4          105   Edward      Sales   38   60000     12   2010-11-25    Male

   Bonus  Rating Performance
0   5000     4.5        Good
1   7000     4.0     Average
2   6000     3.8     Average
3   4500     4.7   Excellent
4   5000     3.5     Average

In [13]:
filtered=d[(d["Years"]>5) & (d["Department"] == "IT")]
print(filtered)

   Employee_ID     Name Department  Age  Salary  Years Joining Date Gender  \
1          102      Bob         IT   34   70000      8   2017-07-19   Male
2          103  Charlie         IT   41   65000     10   2013-06-01   Male

   Bonus  Rating Performance
1   7000     4.0     Average
2   6000     3.8     Average

In [14]:
d["Tax"]=d["Salary"]*0.1
print(d)

   Employee_ID     Name Department  Age  Salary  Years Joining Date  Gender  \
0          101    Alice         HR   29   50000      4   2020-03-15  Female
1          102      Bob         IT   34   70000      8   2017-07-19    Male
2          103  Charlie         IT   41   65000     10   2013-06-01    Male
3          104    Diana  Marketing   28   55000      3   2021-02-10  Female
4          105   Edward      Sales   38   60000     12   2010-11-25    Male

   Bonus  Rating Performance     Tax
0   5000     4.5        Good  5000.0
1   7000     4.0     Average  7000.0
2   6000     3.8     Average  6500.0
3   4500     4.7   Excellent  5500.0
4   5000     3.5     Average  6000.0

In [15]:
d.to_csv("Modified_Employees.csv", index=False)
print("Dataframe saved")

Dataframe saved